In [1]:
import numpy as np
import pandas as pd 
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv("restaurant_1_week_069.csv")

In [3]:
df

,Order Number,Order Date,Item Name,Quantity,Product Price,Total products
0,2410,2016-04-30 16:56:00,Mango Chutney,1,0.50,5
1,2409,2016-04-29 22:38:00,Mint Sauce,1,0.50,6
2,2409,2016-04-29 22:38:00,Red Sauce,1,0.50,6
3,2408,2016-04-29 20:50:00,Mango Chutney,1,0.50,9
4,2408,2016-04-29 20:50:00,Red Sauce,1,0.50,9
...,...,...,...,...,...,...
141,2394,2016-04-26 17:20:00,Lamb Tikka Biryani,1,10.95,7
142,2395,2016-04-27 17:21:00,Vindaloo,1,11.95,4
143,2405,2016-04-29 18:56:00,Bhuna,1,12.95,4
144,2390,2016-04-25 18:56:00,Hazary Lamb,1,12.95,5
145,2390,2016-04-25 18:56:00,King Prawn Shaslick,1,12.95,5